var streets = [{
	value: "10 лет Казахского комсомола",
	data: "Молдагалиева Жубана"
}, {
	value: "19-линия",
	data: "Тажибаевой Патшайым"
}, {
	value: "1-я, 2-я, 3-я Кирпично-заводская",
	data: "Жубановой Газизы Ахметовны"
}, {
	value: "21-линия",
	data: "Егизбаева Косая"
}, {
	value: "4-я Кирпично-заводская",
	data: "Каратаева Мухамеджана"
}, {
	value: "50-летия Октября",
	data: "Райымбека"
}, {
	value: "60 лет Комсомола",
	data: "Жамакаева Бекена"
}, {
	value: "8 Марта",
	data: "Калдаякова Шамши"
}, {
	value: "8-я Кирпично-заводская",
	data: "Кисанова Атымтая"
}, {
	value: "XXIII-го партсъезда",
	data: "Физули"
}, {
	value: "Авангардная",
	data: "Казыбаева Какимжана"
}, {
	value: "Авроры",
	data: "Сокпакбаева Бердибека"
}, {
	value: "Алтынсарина",
	data: "Успенского"
}, {
	value: "Армавирская",
	data: "Бультриковой Балжан"
}, {
	value: "Аэродромная",
	data: "Бокейханова Алихана"
}, {
	value: "Бабушкина",
	data: "Кыдырбекулы Балгабека"
}, {
	value: "Баженова",
	data: "Гончарова Леонида"
}, {
	value: "Балтийская",
	data: "Хожамьярова Махмуда"
}, {
	value: "Барнаульская",
	data: "Сарсенбаева Абу"
}, {
	value: "Баумана",
	data: "Тургута Озала"
}, {
	value: "Безымянная",
	data: "Исеналиева Михаила"
}, {
	value: "Безымянная (Бостандыкский р-н)",
	data: "Дулати Мухаммеда Хайдар"
}, {
	value: "Безымянная (Медеуский р-н)",
	data: "Жолдасбекова Умирбека"
}, {
	value: "Белинского",
	data: "Жансугурова Ильяса"
}, {
	value: "Болотникова",
	data: "Дуйсенова Есена"
}, {
	value: "Ботанический",
	data: "Бухар жырау"
}, {
	value: "Варшавская",
	data: "Дулатова Мыржакыпа"
}, {
	value: "Виноградова",
	data: "Карасай батыра"
}, {
	value: "Владимирская",
	data: "Си Синхая"
}, {
	value: "Восток-3",
	data: "Янушкевич Адольфа"
}, {
	value: "Выборгская",
	data: "Ахтанова Тахауи"
}, {
	value: "Гагарина (п. Дружба)",
	data: "Паклиевского"
}, {
	value: "Городская",
	data: "Бекхожина Калижана"
}, {
	value: "Горького",
	data: "Жибек Жолы"
}, {
	value: "Гражданская",
	data: "Базарбаева Муслима"
}, {
	value: "Грушовая",
	data: "Зверева Максима"
}, {
	value: "Дежнева",
	data: "Сулейменова Рамазана"
}, {
	value: "Дзержинского",
	data: "Наурызбай батыра"
}, {
	value: "Домостроительная",
	data: "Улугбека"
}, {
	value: "Донорская",
	data: "Койчуманова Акана"
}, {
	value: "Дунайская",
	data: "Сидоркина Евгения"
}, {
	value: "Емелева",
	data: "Ришата и Муслима Абдулиных"
}, {
	value: "Железнозаводская",
	data: "Акпаева Жакыпа"
}, {
	value: "Заводская",
	data: "Елебекова Жусипбека"
}, {
	value: "Заломова",
	data: "Ровенского"
}, {
	value: "Западная",
	data: "Ескараева Сулеймана"
}, {
	value: "Звездная",
	data: "Беспакова Мукатая"
}, {
	value: "Звенигородская",
	data: "Кудерина Жумахана"
}, {
	value: "Зенкова (п. Горный Гигант)",
	data: "Алдар Косе"
}, {
	value: "Ильича",
	data: "Есенова Шахмардана"
}, {
	value: "Интернациональная",
	data: "Мауленова Сырбая"
}, {
	value: "Интернациональная (п. Зоря Востока)",
	data: "Бердигулова Абдыгаппара"
}, {
	value: "Кавалерийская",
	data: "Ашимбаева Сагата"
}, {
	value: "Казачья",
	data: "Потанина"
}, {
	value: "Калинина",
	data: "Кабанбай батыра"
}, {
	value: "Карла Маркса",
	data: "Кунаева Динмухамеда"
}, {
	value: "Кирова",
	data: "Богенбай батыра"
}, {
	value: "Кихтенко",
	data: "Байкадамова Бахытжана"
}, {
	value: "Коммунистическая (п. Алатау)",
	data: "Каипова"
}, {
	value: "Коммунистический",
	data: "Аблай Хана"
}, {
	value: "Комсомольская",
	data: "Толе би"
}, {
	value: "Космонавтов",
	data: "Байтурсынулы Ахмета"
}, {
	value: "Космонавтов (п. Алатау)",
	data: "Жетебаева Абила"
}, {
	value: "Красина",
	data: "Валиханова Чокана"
}, {
	value: "Красноармейская",
	data: "Бейсебаева Масымхана"
}, {
	value: "Красногвардейский тракт",
	data: "Суюнбая"
}, {
	value: "Красных партизан",
	data: "Иштван Коныра"
}, {
	value: "Кремлевская",
	data: "Майлина Беимбета"
}, {
	value: "Ленина",
	data: "Достык"
}, {
	value: "Ленина (Медеуский р-н)",
	data: "Байжанова Сапара"
}, {
	value: "Ленина (п. Алатау, Медеуский р-н)",
	data: "Ибрагимова Шавката"
}, {
	value: "Ленина (п. Заря Востока)",
	data: "Биянху"
}, {
	value: "Ленинградская",
	data: "Гете"
}, {
	value: "Ленинская смена",
	data: "Акан Серы"
}, {
	value: "Лесная",
	data: "Омарова Ильяса"
}, {
	value: "Липецкая",
	data: "Айбасова Бирмухамеда"
}, {
	value: "Лобачевского",
	data: "Жансугурова Ильяса (продолжение)"
}, {
	value: "Локомотивная",
	data: "Аймауытова Жусипбека"
}, {
	value: "Луначарского",
	data: "Ниязбекова Сабыра"
}, {
	value: "Лунная",
	data: "Беспакова Кобека"
}, {
	value: "Магниторская",
	data: "Ногайбаева Ыдырыса"
}, {
	value: "Мате Залки",
	data: "Утеген Батыра"
}, {
	value: "Мельничная",
	data: "Курмангалиева Гарифоллы"
}, {
	value: "Мечникова",
	data: "Шарипова Ади"
}, {
	value: "Микояна",
	data: "Шокай Мустафы"
}, {
	value: "Мира",
	data: "Желтоксан"
}, {
	value: "Мичурина",
	data: "Досмухамедова Халела"
}, {
	value: "Мориса Тереза",
	data: "Радостовца Владимира"
}, {
	value: "Новосельская",
	data: "Колпаковского Герасима"
}, {
	value: "Новочеркасская",
	data: "Булкушева Баубека"
}, {
	value: "Обручева",
	data: "Рыскулбекова Кайрата"
}, {
	value: "Овчарова",
	data: "Ходжанова Султанбека"
}, {
	value: "Октябрьская",
	data: "Айтеке би"
}, {
	value: "Октябрьская (п. Заря Востока)",
	data: "Цунвазо Юсупа"
}, {
	value: "Охотская",
	data: "Иванова-Сокольского М."
}, {
	value: "Пастера",
	data: "Макатаева"
}, {
	value: "Патриса Лумумбы",
	data: "Озтюрка Мустафы"
}, {
	value: "Петрова",
	data: "Емцова"
}, {
	value: "Пионерская",
	data: "Майбороды Михаила"
}, {
	value: "Порт-Артура (п. Дружба)",
	data: "Садвакасова Гожахмета"
}, {
	value: "Правды",
	data: "Алтынсарина Ыбырай"
}, {
	value: "Пролетарская",
	data: "Зенкова"
}, {
	value: "Речная",
	data: "Кармысова Камала"
}, {
	value: "Ровенская",
	data: "Кожабекова Кененбая"
}, {
	value: "Розовая",
	data: "Ратушного Юрия"
}, {
	value: "Розы Люксембург",
	data: "Кулымбетова Узакбая"
}, {
	value: "Руднева",
	data: "Брусиловского"
}, {
	value: "Севанская",
	data: "Бокеева Оралхана"
}, {
	value: "Северная",
	data: "Болтирик шешена"
}, {
	value: "Седова",
	data: "Торекулова Назыра"
}, {
	value: "Семипалатинская",
	data: "Табаякова Жамбыла"
}, {
	value: "Слободская",
	data: "Алии Молдагуловой"
}, {
	value: "Советская",
	data: "Казыбек би"
}, {
	value: "Советской Конституции",
	data: "Бекмаханова Ермухана"
}, {
	value: "Сормовская",
	data: "Анны Никольской"
}, {
	value: "Софьи Ковалевской",
	data: "Тлендиева Нургисы"
}, {
	value: "Спортивная",
	data: "Сауранбаева Тлеуберды"
}, {
	value: "Талгарская",
	data: "Каирбекова Гафу"
}, {
	value: "Тесленко",
	data: "Жумабаева Магжана"
}, {
	value: "Университетская",
	data: "Шашкина Зеина"
}, {
	value: "Ушакова",
	data: "Прокофьева"
}, {
	value: "Фестивальная",
	data: "Токтабаева Карима"
}, {
	value: "Фрунзе",
	data: "Торайгырова Султанмахмуда"
}, {
	value: "Хлебная",
	data: "Байтасова Багадурбека"
}, {
	value: "Цветочная",
	data: "Серикова Сайлау"
}, {
	value: "Чапаева",
	data: "Манаса"
}, {
	value: "Чукотская",
	data: "Мусина Капана"
}, {
	value: "Шверника",
	data: "Танышбаева Мухамеджана"
}, {
	value: "Юных коммунаров",
	data: "Алимжанова Ануара"
}];

$(document).ready(function(e) {
	$.each(streets, function(i) {
/* 		$('.b-existing__items').append('<span class="e-existing__item">' + streets[i].value + ' → ' + streets[i].data + '</span>'); */
		$('.b-existing__items__wrapper').append('<tr><td style="text-align: right;">' + streets[i].value + '</td><td width="100" style="text-align:center;">→</td><td>' + streets[i].data + '</td></tr>')
	});
	$('.e-search__street').focus().autocomplete({
	    lookup: streets,
	    formatResult: function(suggestion, currentValue) {
			$('.b-search__items').html('Старое название <p class="e-old__street">' + suggestion.value + '</p> Новое название <p class="e-new__street">' + suggestion.data + '</p>');
	    },
	    onInvalidateSelection : function() {
			this.addClass('e-search__error');
	    },
	    onSelect: function (suggestion) {
	    	this.val = suggestion.value;
	    }
	});
});