const Streets = () => {
  return [{
    old: '10 лет Казахского комсомола',
    new: 'Молдагалиева Жубана'
  }, {
    old: '19-линия',
    new: 'Тажибаевой Патшайым'
  }, {
    old: '1-я, 2-я, 3-я Кирпично-заводская',
    new: 'Жубановой Газизы Ахметовны'
  }, {
    old: '21-линия',
    new: 'Егизбаева Косая'
  }, {
    old: '4-я Кирпично-заводская',
    new: 'Каратаева Мухамеджана'
  }, {
    old: '50-летия Октября',
    new: 'Райымбека'
  }, {
    old: '60 лет Комсомола',
    new: 'Жамакаева Бекена'
  }, {
    old: '8 Марта',
    new: 'Калдаякова Шамши'
  }, {
    old: '8-я Кирпично-заводская',
    new: 'Кисанова Атымтая'
  }, {
    old: 'XXIII-го партсъезда',
    new: 'Физули'
  }, {
    old: 'Авангардная',
    new: 'Казыбаева Какимжана'
  }, {
    old: 'Авроры',
    new: 'Сокпакбаева Бердибека'
  }, {
    old: 'Алтынсарина',
    new: 'Успенского'
  }, {
    old: 'Армавирская',
    new: 'Бультриковой Балжан'
  }, {
    old: 'Аэродромная',
    new: 'Бокейханова Алихана'
  }, {
    old: 'Бабушкина',
    new: 'Кыдырбекулы Балгабека'
  }, {
    old: 'Баженова',
    new: 'Гончарова Леонида'
  }, {
    old: 'Балтийская',
    new: 'Хожамьярова Махмуда'
  }, {
    old: 'Барнаульская',
    new: 'Сарсенбаева Абу'
  }, {
    old: 'Баумана',
    new: 'Тургута Озала'
  }, {
    old: 'Безымянная',
    new: 'Исеналиева Михаила'
  }, {
    old: 'Безымянная (Бостандыкский р-н)',
    new: 'Дулати Мухаммеда Хайдар'
  }, {
    old: 'Безымянная (Медеуский р-н)',
    new: 'Жолдасбекова Умирбека'
  }, {
    old: 'Белинского',
    new: 'Жансугурова Ильяса'
  }, {
    old: 'Болотникова',
    new: 'Дуйсенова Есена'
  }, {
    old: 'Ботанический',
    new: 'Бухар жырау'
  }, {
    old: 'Варшавская',
    new: 'Дулатова Мыржакыпа'
  }, {
    old: 'Виноградова',
    new: 'Карасай батыра'
  }, {
    old: 'Владимирская',
    new: 'Си Синхая'
  }, {
    old: 'Восток-3',
    new: 'Янушкевич Адольфа'
  }, {
    old: 'Выборгская',
    new: 'Ахтанова Тахауи'
  }, {
    old: 'Гагарина (п. Дружба)',
    new: 'Паклиевского'
  }, {
    old: 'Городская',
    new: 'Бекхожина Калижана'
  }, {
    old: 'Горького',
    new: 'Жибек Жолы'
  }, {
    old: 'Гражданская',
    new: 'Базарбаева Муслима'
  }, {
    old: 'Грушовая',
    new: 'Зверева Максима'
  }, {
    old: 'Дежнева',
    new: 'Сулейменова Рамазана'
  }, {
    old: 'Дзержинского',
    new: 'Наурызбай батыра'
  }, {
    old: 'Домостроительная',
    new: 'Улугбека'
  }, {
    old: 'Донорская',
    new: 'Койчуманова Акана'
  }, {
    old: 'Дунайская',
    new: 'Сидоркина Евгения'
  }, {
    old: 'Емелева',
    new: 'Ришата и Муслима Абдулиных'
  }, {
    old: 'Железнозаводская',
    new: 'Акпаева Жакыпа'
  }, {
    old: 'Заводская',
    new: 'Елебекова Жусипбека'
  }, {
    old: 'Заломова',
    new: 'Ровенского'
  }, {
    old: 'Западная',
    new: 'Ескараева Сулеймана'
  }, {
    old: 'Звездная',
    new: 'Беспакова Мукатая'
  }, {
    old: 'Звенигородская',
    new: 'Кудерина Жумахана'
  }, {
    old: 'Зенкова (п. Горный Гигант)',
    new: 'Алдар Косе'
  }, {
    old: 'Ильича',
    new: 'Есенова Шахмардана'
  }, {
    old: 'Интернациональная',
    new: 'Мауленова Сырбая'
  }, {
    old: 'Интернациональная (п. Зоря Востока)',
    new: 'Бердигулова Абдыгаппара'
  }, {
    old: 'Кавалерийская',
    new: 'Ашимбаева Сагата'
  }, {
    old: 'Казачья',
    new: 'Потанина'
  }, {
    old: 'Калинина',
    new: 'Кабанбай батыра'
  }, {
    old: 'Карла Маркса',
    new: 'Кунаева Динмухамеда'
  }, {
    old: 'Кирова',
    new: 'Богенбай батыра'
  }, {
    old: 'Кихтенко',
    new: 'Байкадамова Бахытжана'
  }, {
    old: 'Коммунистическая (п. Алатау)',
    new: 'Каипова'
  }, {
    old: 'Коммунистический',
    new: 'Аблай Хана'
  }, {
    old: 'Комсомольская',
    new: 'Толе би'
  }, {
    old: 'Космонавтов',
    new: 'Байтурсынулы Ахмета'
  }, {
    old: 'Космонавтов (п. Алатау)',
    new: 'Жетебаева Абила'
  }, {
    old: 'Красина',
    new: 'Валиханова Чокана'
  }, {
    old: 'Красноармейская',
    new: 'Бейсебаева Масымхана'
  }, {
    old: 'Красногвардейский тракт',
    new: 'Суюнбая'
  }, {
    old: 'Красных партизан',
    new: 'Иштван Коныра'
  }, {
    old: 'Кремлевская',
    new: 'Майлина Беимбета'
  }, {
    old: 'Ленина',
    new: 'Достык'
  }, {
    old: 'Ленина (Медеуский р-н)',
    new: 'Байжанова Сапара'
  }, {
    old: 'Ленина (п. Алатау, Медеуский р-н)',
    new: 'Ибрагимова Шавката'
  }, {
    old: 'Ленина (п. Заря Востока)',
    new: 'Биянху'
  }, {
    old: 'Ленинградская',
    new: 'Гете'
  }, {
    old: 'Ленинская смена',
    new: 'Акан Серы'
  }, {
    old: 'Лесная',
    new: 'Омарова Ильяса'
  }, {
    old: 'Липецкая',
    new: 'Айбасова Бирмухамеда'
  }, {
    old: 'Лобачевского',
    new: 'Жансугурова Ильяса (продолжение)'
  }, {
    old: 'Локомотивная',
    new: 'Аймауытова Жусипбека'
  }, {
    old: 'Луначарского',
    new: 'Ниязбекова Сабыра'
  }, {
    old: 'Лунная',
    new: 'Беспакова Кобека'
  }, {
    old: 'Магниторская',
    new: 'Ногайбаева Ыдырыса'
  }, {
    old: 'Мате Залки',
    new: 'Утеген Батыра'
  }, {
    old: 'Мельничная',
    new: 'Курмангалиева Гарифоллы'
  }, {
    old: 'Мечникова',
    new: 'Шарипова Ади'
  }, {
    old: 'Микояна',
    new: 'Шокай Мустафы'
  }, {
    old: 'Мира',
    new: 'Желтоксан'
  }, {
    old: 'Мичурина',
    new: 'Досмухамедова Халела'
  }, {
    old: 'Мориса Тереза',
    new: 'Радостовца Владимира'
  }, {
    old: 'Новосельская',
    new: 'Колпаковского Герасима'
  }, {
    old: 'Новочеркасская',
    new: 'Булкушева Баубека'
  }, {
    old: 'Обручева',
    new: 'Рыскулбекова Кайрата'
  }, {
    old: 'Овчарова',
    new: 'Ходжанова Султанбека'
  }, {
    old: 'Октябрьская',
    new: 'Айтеке би'
  }, {
    old: 'Октябрьская (п. Заря Востока)',
    new: 'Цунвазо Юсупа'
  }, {
    old: 'Охотская',
    new: 'Иванова-Сокольского М.'
  }, {
    old: 'Пастера',
    new: 'Макатаева'
  }, {
    old: 'Патриса Лумумбы',
    new: 'Озтюрка Мустафы'
  }, {
    old: 'Петрова',
    new: 'Емцова'
  }, {
    old: 'Пионерская',
    new: 'Майбороды Михаила'
  }, {
    old: 'Порт-Артура (п. Дружба)',
    new: 'Садвакасова Гожахмета'
  }, {
    old: 'Правды',
    new: 'Алтынсарина Ыбырай'
  }, {
    old: 'Пролетарская',
    new: 'Зенкова'
  }, {
    old: 'Речная',
    new: 'Кармысова Камала'
  }, {
    old: 'Ровенская',
    new: 'Кожабекова Кененбая'
  }, {
    old: 'Розовая',
    new: 'Ратушного Юрия'
  }, {
    old: 'Розы Люксембург',
    new: 'Кулымбетова Узакбая'
  }, {
    old: 'Руднева',
    new: 'Брусиловского'
  }, {
    old: 'Севанская',
    new: 'Бокеева Оралхана'
  }, {
    old: 'Северная',
    new: 'Болтирик шешена'
  }, {
    old: 'Седова',
    new: 'Торекулова Назыра'
  }, {
    old: 'Семипалатинская',
    new: 'Табаякова Жамбыла'
  }, {
    old: 'Слободская',
    new: 'Алии Молдагуловой'
  }, {
    old: 'Советская',
    new: 'Казыбек би'
  }, {
    old: 'Советской Конституции',
    new: 'Бекмаханова Ермухана'
  }, {
    old: 'Сормовская',
    new: 'Анны Никольской'
  }, {
    old: 'Софьи Ковалевской',
    new: 'Тлендиева Нургисы'
  }, {
    old: 'Спортивная',
    new: 'Сауранбаева Тлеуберды'
  }, {
    old: 'Талгарская',
    new: 'Каирбекова Гафу'
  }, {
    old: 'Тесленко',
    new: 'Жумабаева Магжана'
  }, {
    old: 'Университетская',
    new: 'Шашкина Зеина'
  }, {
    old: 'Ушакова',
    new: 'Прокофьева'
  }, {
    old: 'Фестивальная',
    new: 'Токтабаева Карима'
  }, {
    old: 'Фрунзе',
    new: 'Торайгырова Султанмахмуда'
  }, {
    old: 'Хлебная',
    new: 'Байтасова Багадурбека'
  }, {
    old: 'Цветочная',
    new: 'Серикова Сайлау'
  }, {
    old: 'Чапаева',
    new: 'Манаса'
  }, {
    old: 'Чукотская',
    new: 'Мусина Капана'
  }, {
    old: 'Шверника',
    new: 'Танышбаева Мухамеджана'
  }, {
    old: 'Юных коммунаров',
    new: 'Алимжанова Ануара'
  }];
};
export default Streets;
